{
  "students":[
    {
      "name":"Matthew",
      "passcode":"oi2491",
      "assignments_info":[
        {
          "type":"lab",
          "number":1,
          "marks":[
            0, 0, 1, 6, 5, 1, 1, 2
          ],
          "comment":"Very nice drawing program! I really like the splatter feature; it’s the first time I've seen anyone think of that. It is creative and easy to use. Good job!"
        },
        {
          "type":"lab",
          "number":2,
          "marks":[
            3, [
              {"mark":2, "comment":"No comment."},
              {"mark":2, "comment":"No comment."},
              {"mark":0, "comment":"No comment."},
              {"mark":0, "comment":"No comment."}
              ], 2, 1, 1, 1
          ],
          "comment":"Nice idle game. Good use of accelerometer and click and drag. I think its better than cookie clicker, not that that is saying much ;p"
        }
      ]
    },
    {
      "name":"Tyler",
      "passcode":"i2piq4",
      "assignments_info":[
        {
          "type":"lab",
          "number":1,
          "marks":[
            0, 0, 1, 6, 5, 1, 0.5, 0
          ],
          "comment":"Cool program! All the buttons work and there is a very organized HUD. There is a small glitch that after clearing the canvas, it forces the pen to turn into an eraser. The spray bottle also looks a bit strange because the drawn dots are not fills but strokes. But overall, good work!"
        },
        {
          "type":"lab",
          "number":2,
          "marks":[
            3, [
              {"mark":2, "comment":"No comment."},
              {"mark":0, "comment":"No comment."},
              {"mark":0, "comment":"No comment."},
              {"mark":0, "comment":"No comment."}
              ], 1, 0.5, 1, 1
          ],
          "comment":"Nice modification of your punishing car game. While it is somewhat less punishing, it is still not completely intuitive turn using left and right joystick. Good job though!"
        }

      ]
    },
    {
      "name":"Jack",
      "passcode":"nox444",
      "assignments_info":[
        {
          "type":"lab",
          "number":1,
          "marks":[
            2, 2, 1, 6, 4, 1, 0.5, 0
          ],
          "comment":"Good job! The program can perform all of the basic functions. Your program also gives errors from the Camera built-in class because you have an extara camera layer that is not needed. When I select a different color it draws a segment in old color and then switches; I'm not sure what is wrong either because I think your code makes sense."
        },
        {
          "type":"lab",
          "number":2,
          "marks":[
            3, [
              {"mark":2, "comment":"No comment."},
              {"mark":0, "comment":"No comment."},
              {"mark":0, "comment":"No comment."},
              {"mark":0, "comment":"No comment."}
              ], 2, 1, 1, 1
          ],
          "comment":"Great job implementing the joystick to make a cool interactive maze game! Why do I respawn in different locations when I am hit from different places though?"
        }
      ]
    }
  ]
}
